# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

# Binaries
brew 'ack'
brew 'age'
brew 'bat'
brew 'coreutils'
brew 'dos2unix'
brew 'exa'
brew 'fd'
brew 'fish'
brew 'fisher'
brew 'fzf'
brew 'geoip'
brew 'go'
brew 'htop'
brew 'jq'
brew 'mas'
brew 'nmap'
brew 'p7zip'
brew 'starship'
brew 'terraform'
brew 'tree'
brew 'wget'
brew 'zellij'

# Fonts
cask 'font-fira-code-nerd-font'

# Casks
cask '1password'
cask 'blockblock'
cask 'bruno'
cask 'discord'
cask 'drawio'
cask 'evernote'
cask 'goland'
cask 'iterm2'
cask 'joplin'
cask 'knockknock'
cask 'little-snitch'
cask 'oversight'
cask 'raindropio'
cask 'rectangle'
cask 'reikey'
cask 'shottr'
cask 'sublime-text'
cask 'taskexplorer'
cask 'ubersicht'
cask 'vlc'
cask 'zoom' unless system "mdfind -name 'kMDItemFSName==\"zoom.us.app\"' | grep -q zoom.us"
